package com.pplab4_8.moblileCommunication.command;

/**
 * Інтерфейс Command визначає стандартний контракт для всіх команд,
 * які виконуються в системі мобільної мережі.
 */
public interface Command {

    /**
     * Метод, який виконує основну дію команди.
     * Цей метод обов'язково повинен бути реалізований у кожному класі,
     * який реалізує цей інтерфейс.
     */
    public void execute();

    /**
     * Метод за замовчуванням для отримання назви команди.
     * Повертає просту назву класу, який реалізує цей інтерфейс.
     * Може бути перевизначений у класі для специфічної назви.
     *
     * @return назва команди (за замовчуванням - ім'я класу).
     */
    default String getName() {
        return this.getClass().getSimpleName();
    }
}